[
  {
    Image: "./assets./images/braigel3.jpg",
    number: 1,

    discriptionRight:
      "В 1559 году, когда создавалось это произведение, красный считался цветом греха, а голубой часто означал обман или глупость. ",

    discription:
      "Но некоторые фразы требуют разъяснений. Например, метла, точащая из окна («выставить метлу»), означает «развлекаться в отсутствии хозяина», а целующаяся парочка под ней («жениться под метлой») — сожительство без брака. Выражение «крыть крышу (сладкими) пирогами» подразумевает чьё-то богатство; «дыра в (чьей-то) крыше» — глупость.",
    discription2:
      "В этой части картины можно увидеть знакомые нам поговорки «как карта ляжет» (падающие карты), «жребий брошен» (игральные кости рядом с картами), «дуракам везёт» (или «дуракам идёт карта»), «смотреть сквозь пальцы», «водить друг друга за нос», «мочиться против ветра» (во фламандском — «мочиться на луну») и «гадить на мир», а также «мир перевернулся вверх тормашками» (перевёрнутый глобус с крестом внизу).",
    discription3:
      "Но некоторые фразы требуют разъяснений. Например, метла, точащая из окна («выставить метлу»), означает «развлекаться в отсутствии хозяина», а целующаяся парочка под ней («жениться под метлой») — сожительство без брака. Выражение «крыть крышу (сладкими) пирогами» подразумевает чьё-то богатство; «дыра в (чьей-то) крыше» — глупость.",
    discription4:
      "Но некоторые фразы требуют разъяснений. Например, метла, точащая из окна («выставить метлу»), означает «развлекаться в отсутствии хозяина», а целующаяся парочка под ней («жениться под метлой») — сожительство без брака. Выражение «крыть крышу (сладкими) пирогами» подразумевает чьё-то богатство; «дыра в (чьей-то) крыше» — глупость.",
    back1: "у стен есть уши",
    back2: "старая крыша требует множества заплаток",
    back3: "дуракам идёт карта",
  },
  {
    Image: "./assets/images/braigel4.jpg",
    number: 2,

    discriptionRight:
      "В 1559 году, когда создавалось это произведение, красный считался цветом греха, а голубой часто означал обман или глупость. ",

    discription3:
      "В этой части картины можно увидеть знакомые нам поговорки «как карта ляжет» (падающие карты), «жребий брошен» (игральные кости рядом с картами), «дуракам везёт» (или «дуракам идёт карта»), «смотреть сквозь пальцы», «водить друг друга за нос», «мочиться против ветра» (во фламандском — «мочиться на луну») и «гадить на мир», а также «мир перевернулся вверх тормашками» (перевёрнутый глобус с крестом внизу).",
    discription2:
      "Но некоторые фразы требуют разъяснений. Например, метла, точащая из окна («выставить метлу»), означает «развлекаться в отсутствии хозяина», а целующаяся парочка под ней («жениться под метлой») — сожительство без брака. Выражение «крыть крышу (сладкими) пирогами» подразумевает чьё-то богатство; «дыра в (чьей-то) крыше» — глупость.",
    discription4:
      "Но некоторые фразы требуют разъяснений. Например, метла, точащая из окна («выставить метлу»), означает «развлекаться в отсутствии хозяина», а целующаяся парочка под ней («жениться под метлой») — сожительство без брака. Выражение «крыть крышу (сладкими) пирогами» подразумевает чьё-то богатство; «дыра в (чьей-то) крыше» — глупость.",
    back1: "у стен есть уши",
    back2: "старая крыша требует множества заплаток",
    back3: "дуракам идёт карта",
  },
  {
    Image: "../images/braigel3.jpg",
    number: 3,

    discriptionRight:
      "В 1559 году, когда создавалось это произведение, красный считался цветом греха, а голубой часто означал обман или глупость. ",
    discription3:
      "В этой части картины можно увидеть знакомые нам поговорки «как карта ляжет» (падающие карты), «жребий брошен» (игральные кости рядом с картами), «дуракам везёт» (или «дуракам идёт карта»), «смотреть сквозь пальцы», «водить друг друга за нос», «мочиться против ветра» (во фламандском — «мочиться на луну») и «гадить на мир», а также «мир перевернулся вверх тормашками» (перевёрнутый глобус с крестом внизу).",

    discription2:
      "В этой части картины можно увидеть знакомые нам поговорки «как карта ляжет» (падающие карты), «жребий брошен» (игральные кости рядом с картами), «дуракам везёт» (или «дуракам идёт карта»), «смотреть сквозь пальцы», «водить друг друга за нос», «мочиться против ветра» (во фламандском — «мочиться на луну») и «гадить на мир», а также «мир перевернулся вверх тормашками» (перевёрнутый глобус с крестом внизу).",
    discription:
      "Но некоторые фразы требуют разъяснений. Например, метла, точащая из окна («выставить метлу»), означает «развлекаться в отсутствии хозяина», а целующаяся парочка под ней («жениться под метлой») — сожительство без брака. Выражение «крыть крышу (сладкими) пирогами» подразумевает чьё-то богатство; «дыра в (чьей-то) крыше» — глупость.",
    discription4:
      "Но некоторые фразы требуют разъяснений. Например, метла, точащая из окна («выставить метлу»), означает «развлекаться в отсутствии хозяина», а целующаяся парочка под ней («жениться под метлой») — сожительство без брака. Выражение «крыть крышу (сладкими) пирогами» подразумевает чьё-то богатство; «дыра в (чьей-то) крыше» — глупость.",
    back1: "у стен есть уши",
    back2: "старая крыша требует множества заплаток",
    back3: "дуракам идёт карта",
  },
];

// let fragments = JSON.parse(json);
// console.log(fragments);

// let arrDiscription = [
//   {
//     number: 1,
//     discription:
//       "Яйцо в корзине под навесом напоминает о необходимости оставлять что-то про запас («оставлять в гнезде одно яйцо»).",
//     answer: "Крыша без дранки",
//   },
//   {
//     number: 2,
//     discription:
//       "Деревянная обувь рядом с человеком, смотрящим сквозь пальцы, указывает на напрасное ожидание («тут стоят деревянные башмаки»)",
//     answer: "иметь зубную боль за ушами",
//   },
//   {
//     number: 3,
//     discription:
//       " Арбалетчик, выстреливший дважды («выстрелить вторым болтом, чтобы поймать первый»), повторяет глупое действие, а также расходует все запасы",
//     answer: "расстрелять все стрелы",
//   },
//   {
//     number: 4,
//     discription:
//       "Сцена с селянином, бегущим по полю за свиньями, скрывает сразу четыре крылатых выражения",
//     answer: "бежать, будто задница горит",
//   },
//   {
//     number: 5,
//     discription:
//       "Тут внимание привлекают юноша на вершине башни, размахивающий плащом, и старик рядом с ним, пускающий перья по ветру.",
//     answer: "вешать плащ по ветру",
//   },
//   {
//     number: 6,
//     discription:
//       "Пять пословиц зашифрованы на площадке, где столкнулись три человека и скот. Когда у кого-то настаёт чёрный период в жизни, говорят, что он «свалился с быка на ослиную задницу», а о том, кто «вешает на себя бремя» — что он преувеличивает свои неприятности.",
//     answer: "один нищий жалеет, что другой нищий встал у его двери",
//   },
// ];

// console.log(arrDiscription);

let json = `[
  {
      "name": "как карта ляжет",
      "picture": "05",
      "info": "падающие карты"
  },
  {
      "name": "перевёрнутый глобус с крестом внизу",
      "picture": "05",
      "info": "мир перевернулся вверх тормашками"
  },
  {
      "name": "жениться под метлой(целующаяся парочка под метлой)",
      "picture": "05",
      "info": "сожительство без брака"
  },
  {
      "name": "выставить метлу",
      "picture": "01",
      "info": "«развлекаться в отсутствии хозяина"
  },
  {
      "name": "«крыть крышу (сладкими) пирогами»",
      "picture": "01",
      "info": "чьё-то богатство"
  },
  {
      "name": "«оставлять в гнезде одно яйцо»(Яйцо в корзине под навесом )",
      "picture": "06.jpg",
      "info": "напоминает о необходимости оставлять что-то про запас "
  },
  {
      "name": "смыслы, «зашифрованные» в фигуре женщины в красном платье, накидывающей на мужчину голубой плащ (в центре композиции), невозможно распознать без знания цветовой символики. В 1559 году, когда создавалось это произведение, красный считался цветом греха, а голубой часто означал обман или глупость. Так что это не просто заботливая супруга накрывает накидкой своего благоверного, она изменяет ему.",
      "picture": "10",
      "info": "супруга изменяет мужу"
  },
  {
      "name": "«бежать, будто задница горит»",
      "picture": "02",
      "info": ""
  },
  {
      "name": "«кто глотает огонь, испражняется искрами»",
      "picture": "02",
      "info": "не удивляйтесь результату, когда решаетесь на опасное предприятие"
  },
  {
      "name": "«если открыты ворота, свиньи бегут в хлеба",
      "picture": "02",
      "info": "(непредусмотрительность оборачивается бедой)"
  },
  {
      "name": " «зерна меньше — свинья толще»",
      "picture": "02",
      "info": " (если у кого-то убавляется, то у кого-то прибавляется)"
  },
  {
      "name": "«иметь зубную боль за ушами»",
      "picture": "06",
      "info": "симуляция"
  },
  {
      "name": "Арбалетчик, выстреливший дважды («выстрелить вторым болтом, чтобы поймать первый»)",
      "picture": "02",
      "info": "повторяет глупое действие"
  },
  {
      "name": "«расстрелять все стрелы»",
      "picture": "02",
      "info": "расходует все запасы"
  },
  {
      "name": "«бреют дурака без мыла» ",
      "picture": "06",
      "info": "обманывают кого-то"
  },
  {
      "name": "«два дурака под одним капюшоном»",
      "picture": "06",
      "info": "глупость любит общество"
  },
  {
      "name": "Ветка, торчащая из окна («растёт из окна»)",
      "picture": "06",
      "info": "значит нечто, что невозможно скрыть"
  },
  {
      "name": "человек, музицирующий в клетке («играть у позорного столба»)",
      "picture": "06",
      "info": "привлекает внимание к чьим-то постыдным поступкам"
  },
  {
      "name": "Крыша без дранки",
      "picture": "06",
      "info": "«у стен есть уши»"
  },
  {
      "name": "юноша на вершине башни, размахивающий плащом «вешать плащ по ветру»",
      "picture": "3",
      "info": "«держать нос по ветру»"
  },
  {
      "name": "старик , пускающий перья по ветру",
      "picture": "03",
      "info": "бесплодные усилия"
  },
  {
      "name": "женщина, глазеющая на аиста",
      "url": "03",
      "info": "праздное времяпровождение"
  },
  {
      "name": "мужичок, прибивающий двух мух одним ударом",
      "picture": "03",
      "info": "напоминает о русской фразе «убить двух зайцев сразу»"
  },
  {
      "name": " «свалился с быка на ослиную задницу»",
      "picture": "07",
      "info": "Когда у кого-то настаёт чёрный период в жизни"
  },
  {
      "name": "«вешает на себя бремя»",
      "picture": "07",
      "info": "что он преувеличивает свои неприятности"
  },
  {
      "name": " «Вытирать зад о дверь»",
      "picture": "07",
      "info": "относиться к кому-то или чему-либо пренебрежительно"
  },
  {
      "name": "«целовать дверное кольцо (дверную ручку)»",
      "picture": "07",
      "info": "быть угодливым"
  },
  {
      "name": "Человек, «рыбачащий мимо сети»",
      "picture": "07",
      "info": "упускает подвернувшиеся возможности"
  },
  {
      "name": "Человек,«кидающий деньги в воду»",
      "picture": "07",
      "info": "тратит их попусту («швыряет на ветер»)"
  },
  {
      "name": "«висит, как нужник над канавой»",
      "picture": "07",
      "info": "нечто само собой разумеющееся."
  },
  {
      "name": "Тот, кто греется у костра, напоминает о пословице «не волнуйся, что чей-то дом горит, пока кто-то может согреться»",
      "picture": "03",
      "info": "то есть, хватайся за любую возможность, не переживая о последствиях для других"
  },
  {
      "name": "«не инжир из коня валится» ",
      "picture": "04",
      "info": "не стоит обманываться первым впечатлением."
  },
  {
      "name": "«когда слепой ведёт слепого, оба упадут в яму»",
      "picture": "04",
      "info": "нет смысла следовать за невеждой."
  },
  {
      "name": "Моряк в лодке одновременно «легко идёт по ветру» ",
      "picture": "04",
      "info": "то есть пользуется благоприятными обстоятельствами"
  },
  {
      "name": "«держит глаз на парусе»",
      "picture": "04",
      "info": "то есть находится начеку"
  },
  {
      "name": "Практически на линии горизонта человек гадит на виселицу",
      "picture": "04",
      "info": "показывает что человекуе не страшны никакие последствия его поступков"
  },
  {
      "name": "мужчина смотрит на гусей, размышляя: «пусть гуси будут гусями, если я не могу их содержать».",
      "picture": "04",
      "info": "не заботься о том, что тебя не касается или «не суй нос, куда не просят"
  },
  {
      "name": "«кто знает, почему гуси босые?»",
      "picture": "04",
      "info": "есть у всего есть причина, хоть и не всегда явная"
  },
  {
      "name": "Фигура, плывущая против течения,  ",
      "picture": "08",
      "info": "с трудом сопротивляется общему мнению."
  },
  {
      "name": "рыбак «держит угря за хвост»",
      "picture": "08",
      "info": "справляеться со сложной задаче"
  },
  {
      "name": "",
      "picture": "",
      "info": ""
}]`;
let proverbs = JSON.parse(json);

document.addEventListener("DOMContentLoaded", function (event) {});

let conctraction = document.querySelector(".composition__body");

conctraction.addEventListener("click", (event) => {
  if (event.target.classList.contains("composition__image")) {
    let urlNumber = event.target.parentNode.id;
    console.log(urlNumber); // получаем номер

    let proverbsFragment = [];
    for (let proverb of proverbs) {
      if (proverb.picture == urlNumber) {
        proverbsFragment.push(proverb);
        //console.log(proverb);
      }
    }
    console.log(proverbsFragment); // получаем массив из соответствующих фрагменту пословиц по номеру

    let proberbsName = proverbsFragment.map((a) => a.name);
    console.log(proberbsName); // массив из имен этих пословиц
    console.log(proberbsName[2]);

    let proberbsInfo = proverbsFragment.map((a) => a.info);
    console.log(proberbsInfo); //  массив из инфо этих пословиц

    // рисуем окно------------------------

    let parentNode = document.createElement("div");
    parentNode.classList.add("consult__form");

    let titleNode = document.createElement("div");
    titleNode.classList.add("consult__text");
    titleNode.textContent = "здесь скрыты пословицы:";

    let imageNode = document.createElement("div");
    imageNode.classList.add("consult__image");

    let fragmentNode = document.createElement("img");
    fragmentNode.src = `./assets/images/${urlNumber}.gif`;

    imageNode.append(fragmentNode);

    let closeNode = document.createElement("a");
    closeNode.classList.add("close-popup");
    closeNode.href = "#popup-close";
    closeNode.textContent = `X`;

    let rowNode = document.createElement("div");
    rowNode.classList.add("questions");

    for (let i = 0; i < proverbsFragment.length; i++) {
      let detailsNode = document.createElement("details");
      detailsNode.classList.add("questions__item");

      let summaryNode = document.createElement("summary");
      summaryNode.textContent = `${proberbsName[i]}`;

      let backNode = document.createElement("p");
      backNode.textContent = `${proberbsInfo[i]}`;

      detailsNode.append(summaryNode);
      detailsNode.append(backNode);

      rowNode.append(detailsNode);
    }

    parentNode.append(titleNode);
    parentNode.append(imageNode);

    parentNode.append(rowNode);
    parentNode.append(closeNode);

    let popup = document.querySelector("#popup");
    popup = popup.append(parentNode);

    closeNode.addEventListener("click", (event) => {
      //popup.classList.add("close");
    });
  }
});
